const { GoogleGenAI } = require("@google/genai");
const dotenv = require("dotenv");
dotenv.config();

const ai = new GoogleGenAI(process.env.GEMINI_API_KEY);

// Google AI Studio
exports.AI = async (req, res) => {
  try {
    const response = await ai.models.generateContent({
      model: "gemini-2.5-flash",
      contents: `محل "كوفي ستار" يضم 10 موظفين ويخدم حوالي 550 عميل نشط، ويقدم مجموعة متنوعة من المنتجات تشمل القهوة، الشاي، العصائر، الحلويات، والساندويشات، مستخدماً مواد خام مثل حبوب القهوة، الشاي، الحليب، السكر، الكريمة، الخبز، والفواكه. خلال الأشهر الثلاثة الأخيرة، شهد المحل أداءً متزايداً في المبيعات والربح. في يناير، بلغت المبيعات حوالي 25,000 دولار مع ربح صافي قدره 7,500 دولار، وخدم 450 عميل وقدم 480 طلباً، حيث تم بيع 1,350 منتجاً واستخدام 200 كجم من المواد الخام، مع مخزون متبقي 1,100 وحدة. في فبراير، ارتفعت المبيعات إلى 28,000 دولار مع ربح صافي 8,400 دولار، وخدم المحل 500 عميل وقدم 520 طلباً، وتم بيع 1,500 منتج واستخدام 220 كجم من المواد الخام، مع مخزون متبقي 950 وحدة. وفي مارس، وصلت المبيعات إلى 32,000 دولار مع ربح صافي 9,600 دولار، وخدم 550 عميل وقدم 600 طلباً، وتم بيع 1,700 منتج واستخدام 250 كجم من المواد الخام، مع مخزون متبقي 900 وحدة. نسبة الربح كانت ثابتة تقريباً عند 30% لكل شهر، ومتوسط الطلبات لكل موظف زاد من 48 طلباً في يناير إلى 60 طلباً في مارس، بينما متوسط المنتجات لكل عميل ظل حوالي 3 منتجات لكل عميل. هذا الأداء يشير إلى توسع قاعدة العملاء وزيادة المبيعات بشكل ثابت، مع إدارة جيدة للمخزون والمواد الخام، وفرص لتحفيز المبيعات عبر العروض المتعددة لكل عميل.
       بدي تعطيني نصائح اعملها بناءا على هاي المعلومات و بدي اشياء ابعد عنها عشان اضل محافظ على نجاحي و قسمهم على 3 فقرات بدون ترقيم و يكون النص قصير
      `
    });

    console.log(response.text);
    res.status(200).json({ error: false, text: response.text });
  } catch (error) {
    console.log(error);
    res.status(500).json({ error: true });
  }
};